OpenFOAM-13/tutorials/XiFluid/engine2Valve2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inletFuel
    {
        type            flowRateInletVelocity;
        massFlowRate
        {
            type            table;
            units           ([CAD] [g/CAD]);
            values
            (

                (0          0.0)
                (625        0.0)
                (627.5      0.825)
                (630        1.7)
                (632.5      1.7)
                (635        0.8)
                (637.5      0.0)
                (720        0.0)

            );
            outOfBounds     repeat;
            interpolationScheme linear;
        }
        profile             turbulentBL;
        rho                 rho;
        rhoInlet            0.7;
    }

    inlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    piston
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    liner
    {
        type            noSlip;
    }

    cylinderHead
    {
        type            noSlip;
    }

    ivHead
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    ivStem
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    evHead
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    evStem
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }

    "nonCouple.*"
    {
        type            slip;
    }
}


// ************************************************************************* //
