OpenFOAM-13/tutorials/XiFluid/engine2Valve2D/constant/zonesGenerator
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      zonesGenerator;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ignition
{
    type        cylinder;
    zoneType    cell;
    moveUpdate  false;

    point1  (1 -0.05 -0.12);
    point2  (1 0 -0.12);
    radius  0.03;
}

// ************************************************************************* //
